app/views/drinks/edit.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]
---
<%= link_to 'Show', @drink %>
<%= link_to 'Back', Category.find($currentCategory) %>