app/views/drinks/show.html.erb


<%= link_to 'Back', Category.find($currentCategory) %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 6]]