app/views/dishes/edit.html.erb

<%= link_to 'Show', @dish %>
<%= link_to 'Back', Category.find($currentCategory) %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]