app/views/dishes/new.html.erb

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 4]]
---

<%= link_to 'Back', Menu.find($currentid) %>