app/controllers/categories_controller.rb

def new
  @category = Menu.find($currentMenu).categories.new
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 4]]

def create
  @category = Menu.find($currentMenu).categories.new(category_params)

  respond_to do |format|
    if @category.save
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "categories" ("name", "menu_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "La buena"], ["menu_id", 4], ["created_at", "2016-09-27 13:54:40.071893"], ["updated_at", "2016-09-27 13:54:40.071893"]]

def update
  respond_to do |format|
    if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Pecadores tontos"], ["updated_at", "2016-10-04 13:00:29.788508"], ["id", 1]]

def destroy
  @category.destroy
  respond_to do |format|
    format.html { redirect_to menu_path(Menu.find($currentMenu)), notice: 'Category was successfully destroyed.' }
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]