app/controllers/dishes_controller.rb

  def new
    @dish = Category.find($currentCategory).dishes.new
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 4]]

  def create
    @dish = Category.find($currentCategory).dishes.new(dish_params)

    respond_to do |format|
      if @dish.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "dishes" ("name", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Enchiladas"], ["category_id", 4], ["created_at", "2016-10-03 15:51:17.059295"], ["updated_at", "2016-10-03 15:51:17.059295"]]

  def destroy
    @dish.destroy
    respond_to do |format|
      format.html { redirect_to category_path(Category.find($currentCategory)), notice: 'Dish was successfully destroyed.' }
---
DELETE FROM "dishes" WHERE "dishes"."id" = ?  [["id", 2]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 2]]

    def set_dish
      @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 1]]