app/controllers/drinks_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 6]]
---
  def new
    @drink = Category.find($currentCategory).drinks.new

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "drinks" ("name", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Cerveza Corona"], ["category_id", 6], ["created_at", "2016-10-03 16:14:23.457391"], ["updated_at", "2016-10-03 16:14:23.457391"]]
---
  def create
    @drink = Category.find($currentCategory).drinks.new(drink_params)

    respond_to do |format|
      if @drink.save

UPDATE "drinks" SET "name" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["name", "Sangre de yisus"], ["updated_at", "2016-10-04 13:04:44.463104"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @drink.update(drink_params)

DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    @drink.destroy
    respond_to do |format|
      format.html { redirect_to category_path(Category.find($currentCategory)), notice: 'Drink was successfully destroyed.' }

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_drink
      @drink = Drink.find(params[:id])