app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
    @menus = Menu.all

INSERT INTO "menus" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Principal"], ["created_at", "2016-09-22 13:09:02.731849"], ["updated_at", "2016-09-22 13:09:02.731849"]]
---
  def create
    @menu = Menu.new(menu_params)

    respond_to do |format|
      if @menu.save

DELETE FROM "menus" WHERE "menus"."id" = ?  [["id", 2]]
---
  def destroy
    @menu.destroy

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_menu
      @menu = Menu.find(params[:id])