app/views/categories/edit.html.erb

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 4]]
---
<%= link_to 'Show', @category %>
<%= link_to 'Back', Menu.find($currentMenu) %>