app/views/categories/show.html.erb

<%= link_to 'Edit', edit_category_path(@category) %>
<%= link_to 'Back', Menu.find($currentid) %>
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 4]]